---
kind: other
id: Methods.T:Autodesk.Revit.DB.ContourSetting
source: html/fbf57187-f166-9fd5-df07-892901af372e.htm
---
# ContourSetting Methods

Add a set of contours as a contour setting item to the current contour setting.